#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.update_data_lambda_exec_role: Refreshing state... [id=demo_update_data_lambda_exec_role]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.policy.aws_iam_role.get_investment_year_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role]
module.policy.aws_iam_role.get_metric_types_lambda_exec_role: Refreshing state... [id=demo_get_metric_types_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.upload_file_s3_lambda_function: Refreshing state... [id=/aws/lambda/demo_upload_file_s3_lambda_function]
module.policy.aws_iam_role.add_scenario_lambda_exec_role: Refreshing state... [id=demo_add_scenario_lambda_exec_role]
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s
module.policy.aws_iam_role.get_company_details_lambda_exec_role: Refreshing state... [id=demo_get_company_details_lambda_exec_role]
module.policy.aws_iam_role.get_by_metric_report_lambda_exec_role: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role]
module.policy.aws_iam_role.change_user_role_lambda_exec_role: Refreshing state... [id=demo_change_user_role_lambda_exec_role]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.policy.aws_iam_role.delete_company_lambda_exec_role: Refreshing state... [id=demo_delete_company_lambda_exec_role]
module.policy.aws_iam_role.edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.policy.aws_iam_role.download_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.policy.aws_iam_role.company_investments_lambda_exec_role: Refreshing state... [id=demo_get_company_investments_lambda_exec_role]
module.policy.aws_iam_role.register_lambda_exec_role: Refreshing state... [id=demo_register_lambda_exec_role]
module.policy.aws_iam_role.upload_file_s3_lambda_exec_role: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_company_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_details_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.logs.aws_cloudwatch_log_group.update_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_update_data_lambda_function]
module.logs.aws_cloudwatch_log_group.get_by_metric_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_by_metric_report_lambda_function]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.add_scenario_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_scenario_lambda_function]
module.logs.aws_cloudwatch_log_group.change_user_role_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_user_role_lambda_function]
module.logs.aws_cloudwatch_log_group.download_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_download_comparison_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_year_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_report_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_year_options_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_options_lambda_function]
module.logs.aws_cloudwatch_log_group.message_lambda_function: Refreshing state... [id=/aws/lambda/demo_message_lambda_function]
module.logs.aws_cloudwatch_log_group.get_dynamic_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_dynamic_report_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metric_types_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_types_lambda_function]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.logs.aws_cloudwatch_log_group.get_company_investments_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_investments_lambda_function]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.logs.aws_cloudwatch_log_group.delete_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_scenarios_lambda_function]
module.network.aws_apigatewayv2_api.websocket_api: Refreshing state... [id=9cd29nbvb8]
module.policy.aws_iam_role.delete_scenarios_lambda_exec_role: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.logs.aws_cloudwatch_log_group.validate_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_validate_data_lambda_function]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.delete_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_company_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object: Refreshing state... [id=lambdas/demo/get_dynamic_report_handler.zip]
module.buckets.aws_s3_bucket_object.connect_function_object: Refreshing state... [id=lambdas/demo/connect.zip]
module.buckets.aws_s3_bucket_object.message_function_object: Refreshing state... [id=lambdas/demo/message.zip]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.buckets.aws_s3_bucket_object.disconnect_function_object: Refreshing state... [id=lambdas/demo/disconnect.zip]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.buckets.aws_s3_bucket_object.delete_company_function_object: Refreshing state... [id=lambdas/demo/delete_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/get_edit_modify_data_handler.zip]
module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_report_handler.zip]
module.buckets.aws_s3_bucket_object.delete_scenarios_function_object: Refreshing state... [id=lambdas/demo/delete_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.add_scenario_function_object: Refreshing state... [id=lambdas/demo/add_scenario_handler.zip]
module.buckets.aws_s3_bucket_object.change_user_role_function_object: Refreshing state... [id=lambdas/demo/change_user_role_handler.zip]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.buckets.aws_s3_bucket_object.add_investment_function_object: Refreshing state... [id=lambdas/demo/add_investment_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.buckets.aws_s3_bucket_object.edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/edit_modify_data_handler.zip]
module.buckets.aws_s3_bucket_object.register_function_object: Refreshing state... [id=lambdas/demo/register.zip]
module.buckets.aws_s3_bucket_object.upload_file_s3_function_object: Refreshing state... [id=lambdas/demo/upload_file_s3_handler.zip]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.policy.aws_iam_role.get_all_public_companies_lambda_exec_role: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.connect_lambda_function: Refreshing state... [id=/aws/lambda/demo_connect_lambda_function]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_details_function_object: Refreshing state... [id=lambdas/demo/get_company_details_handler.zip]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.policy.aws_iam_role.get_edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.disconnect_lambda_function: Refreshing state... [id=/aws/lambda/demo_disconnect_lambda_function]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/download_comparison_vs_peers_handler.zip]
module.policy.aws_iam_role.validate_data_lambda_exec_role: Refreshing state... [id=demo_validate_data_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.register_lambda_function: Refreshing state... [id=/aws/lambda/demo_register_lambda_function]
module.policy.aws_iam_role.get_dynamic_report_lambda_exec_role: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_public_companies_handler.zip]
module.logs.aws_cloudwatch_log_group.get_all_public_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_public_companies_lambda_function]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_investments_function_object: Refreshing state... [id=lambdas/demo/get_company_investments_handler.zip]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.buckets.aws_s3_bucket_object.validate_data_function_object: Refreshing state... [id=lambdas/demo/validate_data_handler.zip]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.logs.aws_cloudwatch_log_group.edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_edit_modify_data_lambda_function]
module.policy.aws_iam_role.disconnect_lambda_exec_role: Refreshing state... [id=demo_disconnect_lambda_exec_role]
module.policy.aws_iam_role.message_lambda_exec_role: Refreshing state... [id=demo_message_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object: Refreshing state... [id=lambdas/demo/get_by_metric_report_handler.zip]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.buckets.aws_s3_bucket_object.update_data_function_object: Refreshing state... [id=lambdas/demo/update_data.zip]
module.buckets.aws_s3_bucket_object.get_metric_types_function_object: Refreshing state... [id=lambdas/demo/get_metric_types_handler.zip]
module.policy.aws_iam_role.connect_lambda_exec_role: Refreshing state... [id=demo_connect_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.add_investment_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_investment_lambda_function]
module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_options_handler.zip]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.policy.aws_iam_role.add_investment_lambda_exec_role: Refreshing state... [id=demo_add_investment_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_edit_modify_data_lambda_function]
module.policy.aws_iam_role.get_investment_year_options_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.policy.aws_iam_role_policy.upload_file_s3_policy: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role:demo_upload_file_s3_policy]
module.network.aws_api_gateway_resource.dynamic_report: Refreshing state... [id=7ce5jh]
module.network.aws_api_gateway_resource.upload_file_s3: Refreshing state... [id=u4or2w]
module.network.aws_api_gateway_resource.investments: Refreshing state... [id=bumysj]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.network.aws_api_gateway_resource.investment_report: Refreshing state... [id=iew1mv]
module.network.aws_api_gateway_resource.edit_modify: Refreshing state... [id=qybsqa]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=8rc63h]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.by_metric_report: Refreshing state... [id=890crw]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_vpc: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143307800000002]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_vpc: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648074600000001]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_vpc: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704613000000001]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_vpc: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627406700000002]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_vpc: Refreshing state... [id=demo_message_lambda_exec_role-20220503145603314500000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_vpc: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154817160700000002]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744896400000001]
module.policy.aws_iam_role_policy_attachment.register_lambda_vpc: Refreshing state... [id=demo_register_lambda_exec_role-20220503143910016300000001]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_vpc: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436359500000001]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_vpc: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163629032800000002]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_vpc: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729143000000002]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_vpc: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212704618600000002]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_vpc: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220503145603304000000001]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_vpc: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328473300000001]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_vpc: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127271200000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_vpc: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204627925600000001]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_vpc: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117152800000001]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_vpc: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150845149600000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_vpc: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119918000000001]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_vpc: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403266900000002]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.policy.aws_iam_role_policy_attachment.connect_lambda_logs: Refreshing state... [id=demo_connect_lambda_exec_role-20220420102338091900000002]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_logs: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220420102337857000000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_logs: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436404000000002]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_logs: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163628999400000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_logs: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704618600000003]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744901200000002]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_logs: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627405600000001]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_logs: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150846115600000002]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_logs: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143305700000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_logs: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729123500000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_logs: Refreshing state... [id=demo_message_lambda_exec_role-20220420120428768600000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_logs: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204628035400000002]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_logs: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328477200000002]
module.policy.aws_iam_role_policy_attachment.upload_file_s3_lambda_logs: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role-20220411202109965800000001]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_logs: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117408200000002]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_logs: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648088100000002]
module.policy.aws_iam_role_policy_attachment.register_lambda_logs: Refreshing state... [id=demo_register_lambda_exec_role-20220427122624952100000001]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_logs: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119943200000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_logs: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127368000000002]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_logs: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403233500000001]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_logs: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154816818700000001]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_logs: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212705003500000004]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_logs: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628159500000004]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_vpc: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628072200000003]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=983138]
module.network.aws_api_gateway_resource.dynamic_report_id: Refreshing state... [id=1c508f]
module.network.aws_api_gateway_resource.validate_data: Refreshing state... [id=pi6a5s]
module.network.aws_api_gateway_resource.company_investments: Refreshing state... [id=jd2xz9]
module.network.aws_api_gateway_resource.investment_report_id: Refreshing state... [id=ieupa8]
module.network.aws_api_gateway_resource.invest_year_options: Refreshing state... [id=gq814s]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.network.aws_api_gateway_resource.public_companies: Refreshing state... [id=4v8ab4]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.network.aws_api_gateway_resource.metric_types: Refreshing state... [id=qg9lk5]
module.network.aws_api_gateway_resource.company_details: Refreshing state... [id=hper4a]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.network.aws_api_gateway_resource.by_metric_report_id: Refreshing state... [id=f4ao8c]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:13]
module.functions.aws_lambda_function.connect_lambda_function: Refreshing state... [id=demo_connect_lambda_function]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.network.aws_api_gateway_resource.user_roles: Refreshing state... [id=npbrdw]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=0bc6fs]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_resource.download_comparison_vs_peers: Refreshing state... [id=zgaw7c]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.functions.aws_lambda_function.upload_file_s3_lambda_function: Refreshing state... [id=demo_upload_file_s3_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.functions.aws_lambda_function.update_data_lambda_function: Refreshing state... [id=demo_update_data_lambda_function]
module.functions.aws_lambda_function.add_investment_lambda_function: Refreshing state... [id=demo_add_investment_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.functions.aws_lambda_function.disconnect_lambda_function: Refreshing state... [id=demo_disconnect_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.validate_data_lambda_function: Refreshing state... [id=demo_validate_data_lambda_function]
module.functions.aws_lambda_function.get_investment_year_options_lambda_function: Refreshing state... [id=demo_get_investment_year_options_lambda_function]
module.functions.aws_lambda_function.get_metric_types_lambda_function: Refreshing state... [id=demo_get_metric_types_lambda_function]
module.functions.aws_lambda_function.get_company_investments_lambda_function: Refreshing state... [id=demo_get_company_investments_lambda_function]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.policy.aws_iam_role_policy.get_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role:demo_get_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.policy.aws_iam_role_policy.get_dynamic_report_cognito_policy: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role:demo_get_dynamic_report_cognito_policy]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.policy.aws_iam_role_policy.change_user_role_cognito_policy: Refreshing state... [id=demo_change_user_role_lambda_exec_role:demo_change_user_role_cognito_policy]
module.policy.aws_iam_role_policy.download_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role:demo_download_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.delete_scenarios_cognito_policy: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role:demo_delete_scenarios_cognito_policy]
module.policy.aws_iam_role_policy.get_investment_year_report_cognito_policy: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role:demo_get_investment_year_report_cognito_policy]
module.policy.aws_iam_role_policy.delete_company_cognito_policy: Refreshing state... [id=demo_delete_company_lambda_exec_role:demo_delete_company_cognito_policy]
module.policy.aws_iam_role_policy.get_company_details_cognito_policy: Refreshing state... [id=demo_get_company_details_lambda_exec_role:demo_get_company_details_cognito_policy]
module.policy.aws_iam_role_policy.get_universe_overview_cognito_policy: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role:demo_get_universe_overview_cognito_policy]
module.policy.aws_iam_role_policy.get_all_public_companies_cognito_policy: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role:demo_get_all_public_companies_cognito_policy]
module.policy.aws_iam_role_policy.assign_company_permissions_cognito_policy: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role:demo_assign_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.policy.aws_iam_role_policy.get_by_metric_report_cognito_policy: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role:demo_get_by_metric_report_cognito_policy]
module.policy.aws_iam_role_policy.change_company_publicly_cognito_policy: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role:demo_change_company_publicly_cognito_policy]
module.policy.aws_iam_role_policy.get_company_report_vs_peers_cognito_policy: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role:demo_get_company_report_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.add_scenario_cognito_policy: Refreshing state... [id=demo_add_scenario_lambda_exec_role:demo_add_scenario_cognito_policy]
module.policy.aws_iam_role_policy.get_company_permissions_cognito_policy: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role:demo_get_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.policy.aws_iam_role_policy.get_edit_modify_data_cognito_policy: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role:demo_get_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.edit_modify_data_cognito_policy: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role:demo_edit_modify_data_cognito_policy]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.get_investment_year_report_lambda_function: Refreshing state... [id=demo_get_investment_year_report_lambda_function]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.get_company_details_lambda_function: Refreshing state... [id=demo_get_company_details_lambda_function]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.functions.aws_lambda_function.get_edit_modify_data_lambda_function: Refreshing state... [id=demo_get_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.edit_modify_data_lambda_function: Refreshing state... [id=demo_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.add_scenario_lambda_function: Refreshing state... [id=demo_add_scenario_lambda_function]
module.functions.aws_lambda_function.get_by_metric_report_lambda_function: Refreshing state... [id=demo_get_by_metric_report_lambda_function]
module.functions.aws_lambda_function.delete_scenarios_lambda_function: Refreshing state... [id=demo_delete_scenarios_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.functions.aws_lambda_function.change_user_role_lambda_function: Refreshing state... [id=demo_change_user_role_lambda_function]
module.functions.aws_lambda_function.get_dynamic_report_lambda_function: Refreshing state... [id=demo_get_dynamic_report_lambda_function]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.functions.aws_lambda_function.delete_company_lambda_function: Refreshing state... [id=demo_delete_company_lambda_function]
module.functions.aws_lambda_function.get_all_public_companies_lambda_function: Refreshing state... [id=demo_get_all_public_companies_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.network.aws_apigatewayv2_stage.stage: Refreshing state... [id=demo]
module.functions.aws_lambda_function.message_lambda_function: Refreshing state... [id=demo_message_lambda_function]
module.policy.aws_iam_role_policy.allow_execute_api_register_connection: Refreshing state... [id=demo_register_lambda_exec_role:demo_allow_execute_api_register_connection_policy]
module.policy.aws_lambda_permission.websocket_connect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_register: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_iam_role_policy.allow_execute_api_message_connection: Refreshing state... [id=demo_message_lambda_exec_role:demo_allow_execute_api_message_connection_policy]
module.policy.aws_lambda_permission.websocket_message: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_disconnect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.functions.aws_lambda_function.register_lambda_function: Refreshing state... [id=demo_register_lambda_function]
module.network.aws_apigatewayv2_integration.message_integration: Refreshing state... [id=bwwsvap]
module.network.aws_apigatewayv2_integration.connect_integration: Refreshing state... [id=lov27i5]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_apigatewayv2_integration.disconnect_integration: Refreshing state... [id=usm7qx9]
module.network.aws_apigatewayv2_integration.register_integration: Refreshing state... [id=qzrgtru]
module.network.aws_api_gateway_method.edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_method.get_company_details_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.get_all_public_companies_method: Refreshing state... [id=agm-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_method.change_user_role_method: Refreshing state... [id=agm-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.add_scenario_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_method.get_company_investments_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_method.download_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_method.get_by_metric_report_method: Refreshing state... [id=agm-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_method.delete_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_method.get_investment_year_report_method: Refreshing state... [id=agm-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_method.validate_data_method: Refreshing state... [id=agm-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_method.dynamic_report_method: Refreshing state... [id=agm-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_method.get_investment_year_options_method: Refreshing state... [id=agm-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_method.upload_file_s3_method: Refreshing state... [id=agm-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.get_edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_method.get_metric_types_method: Refreshing state... [id=agm-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_method.add_investment_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.delete_company_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_apigatewayv2_route.connect_route: Refreshing state... [id=lb55rfq]
module.network.aws_apigatewayv2_route.register_route: Refreshing state... [id=f5rytev]
module.network.aws_apigatewayv2_route.message_route: Refreshing state... [id=b6359n3]
module.network.aws_apigatewayv2_route.disconnect_route: Refreshing state... [id=i6ilvcd]
module.network.aws_api_gateway_integration.edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.change_user_role_integration: Refreshing state... [id=agi-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_integration.get_company_details_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_integration.company_investments_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.download_comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_integration.public_companies_integration: Refreshing state... [id=agi-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_integration.by_metric_report_integration: Refreshing state... [id=agi-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.investment_report_integration: Refreshing state... [id=agi-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_integration.validate_data_integration: Refreshing state... [id=agi-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_integration.invest_year_options_integration: Refreshing state... [id=agi-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_integration.delete_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_integration.add_company_scenario_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_integration.dynamic_report_integration: Refreshing state... [id=agi-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_integration.upload_file_s3_integration: Refreshing state... [id=agi-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.get_edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_integration.delete_company_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_integration.add_investment_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_integration.get_metric_types_integration: Refreshing state... [id=agi-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_apigatewayv2_deployment.deploy: Refreshing state... [id=ey3sgf]
module.policy.aws_lambda_permission.apigw_upload_file_s3_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayUploadFileS3]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_get_by_metric_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_validate_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayValidateData]
module.policy.aws_lambda_permission.apigw_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_dynamic_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_delete_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_get_metric_types_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_add_scenario_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_change_user_role_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeUserRole]
module.policy.aws_lambda_permission.apigw_delete_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_investment_year_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_add_investment_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_investment_year_options_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_company_investments_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyInvestmentsId]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_download_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_get_all_public_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "d3e4556582298ebd3832f65497f702e6" -> "44c831653d6a763bc77b80852d4bf9da"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "ece25256bced23383b150518063fa4e5" -> "ef27cf19f42d1d1108ebcb7dea2827ec"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "e4bb4776e6dce3183358389e67fe2ab9" -> "63979c24ce1141437861b7eaee96151b"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "0dda80b3df39aee96a070a290bd74740" -> "4ff1b56728c870dd7191a5c05ee148d4"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "a78ad828dc8206da142fa84f6732c436" -> "c47e3bb5523292d9ce21fc4f6a41e375"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "7fef5645ed68fac7f4a39d231639ad99" -> "354bd1ffa5cfbc5c1627ba8a622020e5"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "53b530dfe657fb250514930d4bf2ea3d" -> "41247c4b13083578b3f89cb9baa2f618"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "7ffe3cb25879575c522e19d05587abff" -> "3c02d042d7b51aa2f2e37a073e0633d8"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "5ec7a89a98eb1a9e819c7309e93649d2" -> "99696e7d6b708d21868f18414603563c"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "e658c3dd4b9b14fc10688f31b9523225" -> "251e1b91909b5f66a99f7704b3952de5"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "22b1fdc5a0836fddce978bc3ae959e90" -> "bdcb1e2fc7577295ad76a72b894da8c5"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "6ba9a97e75b9a0987fe2234c22bf1499" -> "e9b0ee04eb344cb88688cb545eaf5f45"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "28aff1ed434494907e8b6fabd691193c" -> "f24258df4ac584543fffe54b74f84272"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "7d8ab0b57fadbaf06e148451ef7856b8" -> "042c56dd26901fccdaa1be179d40a0ab"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "da10387a14596597ccb36c8dbc53b943" -> "f9b89fcd85b2e1dc2b1cc94b3156940c"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5581cc9d54b140c0a12be90ce88e3767" -> "20f8fc3661b796a47d6da26bb4d8f563"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "0e3bcccbd571e0011f97be27e881a1b7" -> "b2bbac65a8744ec1f3e24fef5953647e"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "142cf26238e0451cc21aa0b984b60c71" -> "4e10c261063f6d224ff72c865dfeacac"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e99ad926f32b52eeae98d64f6fc70ae5" -> "67824ac093a683338e001d482f15ee80"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "2c83c4264ec3b34671241c2e826c26fc" -> "e6913601c0f2ce6b5af073a41219e7e9"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "f7a94a329c6b9958d82447f0b718a8b5" -> "335e7ce7ca1758924428d57ffbfb076e"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "257edf40c611b6ef2aee047a4bfcd459" -> "e42bd6cdaec2dc72dfd970f4deb06304"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "a28a7ae325b963e6ebe238af22b86d73" -> "1e9e801e2e662106ab6992d29efb5115"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_options_function_object" {
      ~ etag               = "252368c3f5c847aad42600f0345906d4" -> "006630150ac8dac16f9c5294a40d5669"
        id                 = "lambdas/demo/get_investment_year_options_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_report_function_object" {
      ~ etag               = "45e7e90886502f46a54d8eed4a5245fc" -> "9dae154200cd3bc98fa7cb8a0deca2b9"
        id                 = "lambdas/demo/get_investment_year_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "0196f8825b91891c5a2e7b4d7c30e87b" -> "53f351eb191128d38c8e5742202ccf2b"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "692556ca0f95fc24986bd9ad5035eef1" -> "4b2383d60c8cb597731ba3b2b789e2a1"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "8b4bd28bc82e7a3fee110cb30faf18a3" -> "35d6aee7d476b27cad4da51ab44de5c8"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "fc641492fadad669f719ee9fc10bbeab" -> "546e90c2162ceaa346fb35dc82db4521"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "cc728fa6307c2cdf383e14962275de21" -> "aa9da8a74554d3d15a52119aa30ac90a"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "fccef2b1097c3d263119746a88b1446a" -> "208add463ddbd445bdaaa634c1958d58"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "86dce17c260e72122f6f5660f691dd24" -> "b5a8dbd471e386968aa729dd4d294a6c"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "1f6d72393d00db524b5556ab45ea5c2c" -> "d9b1d57dad204e72fb4a5873862e01ac"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "840ad615c4462826d27b6af74b166907" -> "092928e5bfd8a65117b2d1c2ce82f7fa"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "82587ee40d5068873e5b0a5183271003" -> "c5f118154033f9da8f63434c4cd52802"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "f69a8eb00f47067f82f56bd0f056bb9b" -> "65ebe021040b3b3c5f669242ff6aef15"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "d44cb9e3baafce6f8777a60fc007f370" -> "4b6b5e2f5e653f2da4cebf303dec0093"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8f420d1a84f93ebf1f06627f73514369" -> "c24832d8b359707b3468d48b90882421"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "yS9qdJFSNqTbOtf3+oJSqBU3eqsVtO48JSb0rG9hd3o=" -> "bbSZusBfxCj5x7i3n11A6hLi18hzfXcFTEgifgevg6Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "chYbmvG/qY/ooXbhpEsg7k6+EkjgR7zudKBOiokDIaQ=" -> "8JTEeB3MeEEf3553MtbGhcnbHa2/hDvTvc0i8NHOvQI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "oJSkJl9jA/xyNl2d22llj43gMJAIHXDMK04Z7Z46TgE=" -> "NgHPD0Q/lfhC8tDe2yoMIjle2kWhRyowcjdvW+oWTEk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "puyUmE9kKPrp1CX6v8ymEOsV9e9Dvi9Z8X+m5Olam1k=" -> "v0NkryLOJPUdFUmL9AjFpETvlAK9pWd6/8Ng/ipx1MU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "6eh1/xtb3mlPfUhzn668NW/CK1g2tItXxagdSLiypTs=" -> "CuJpciZsH0bu+kZiMbo6zVQz3M2oxUmixrYJVuib2hw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "coJluE81niWOWScpBx11nOM1tKwKBkOusfNVfD91wjA=" -> "/1dm4KynhzpbnZMnAthmT4XKDyOiihUSl7Fp9S9pWRU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "LqQXXT+NBRTJTXogNMa0FOxFrtxoWJdTg4diy0ToKzk=" -> "UuhyhFb+UgOVK9swp4FVp4TagcvKPOy9t+Hw4Ty45xE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gve4szKcp61I9TzP/HdXFVUAAEG0oS97FzFGmxNAR9U=" -> "aBLr94axfNLm+h7SRXLExqVQNsXcWBNTno2mONceTsg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "fesLw+q1oAXMR39XYEnba/klA2yj0Bzgk5eRuqtwBRQ=" -> "9oUPnbQoYPnohHeeLnDoHfczL9qlQJQnqKMHyOgxYmM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "O1VnRjGSo+BKmsxBV0WlZVMX4fTAFKyG0TeeBUQilJs=" -> "JBQllEvVmOZHuk7yoOPULcoEdnXS5CTbxGg7lz8nPYM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "7tWetKtWgoa91R9jbkYnog6hkyaC3PU2BGVVVYp3bPI=" -> "zKa2m9Q8SyO6+CiX2pycUAE99Dni4diJBRyeCKW7TRk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-08-18T20:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ioj5Va2QMfP3HGGJBLgA3Yum8197wHLYxvBF3Gm8yNo=" -> "T0QRxtVKbfNf+Iq2nxG7zP9gPlVR8JxtyPeRjnlFNbk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "NwJEnTLhoHGDcE5gJnFwOi3TVKdK0ZVD841fgwX95k8=" -> "umeCDUiNfSatteMACY59NdNm8PAMRqh/H/sSy4srq/0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "JssLJeQx5otwzAqaek16bVrxZg+yDnQLJJ5PADZF+5o=" -> "0pSkv6ymN1xPb0PbuEPF5WhkM5qqTR9AZu/pf7sEZyQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "klpI+mAFxJ55nN+Mb9jErAdlECjT3x3FCRo/lW66HFc=" -> "W675GC2IhVDrM1jCsFOiQbByLbXVJJde2KVddxrFA6k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "04mfddclJhocaESAzcjBGoyFm5vUmLm543nicNmnNWg=" -> "iJ1EBCoh/6khXHiPBSxRR+1X2y0GhQtRi6AKKtJW5II="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "RlTILaiFcjpS5JdlRABwvfLcixjyLsZi19zneDGd368=" -> "29VJXFQZZ5nadpueMKEkgXehRGjruh/wApXf4DeUty0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "6sojfIGjbG/ZkDOvhDau6gzKqUgbZg9EWVkBU1FeYNw=" -> "6M8ftUqT4CA73A+Mzu+0rPnutgSPiPKwJDShRFk7szc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "IYzWu+WiZFje+KPjqOLcHPz1l9z5MWwVHhVTH/gfKaQ=" -> "eBPvpY2jssmUGo/TA6sHhPhCOxflmd8tmsLfGacBPaM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "xdSIOlU5MeSkwSywLiPfdfb+8x0ilqAAVZKynX4KcAY=" -> "tH3SX3ehyxYVGpVaQQfIeN7YB/Xx51uvHKESoQ9mUy0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ne5bHx/9izK8bZ84eWqZCHhI6dEGWswo8G/7BoWGiiA=" -> "0Us/6IQCKXzs4Zaj/zVIA6zER2JRfK44EWw5dOoZfIw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "E+FriMnBpM61SSetxuIbc0ATPY9dMJFaY3DFwy3ujxg=" -> "Rj0U0ie85ayDAefcoojMHW515w/hz0GYEu/j47GbCuY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "aTq/vRabz5dfqRhDbxTbQwAoNg405pJCr1KYMnehdG4=" -> "aGjySl9PiO7MJyECHJs4ViWSHEOSx+AvgxPTf3M2y2I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_options_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_options_lambda_function" {
        id                             = "demo_get_investment_year_options_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "GPsN7Om+fcDiV9lMHsVN8ySmWzLbGqjpXaalFyNcJIM=" -> "7FvirXGJ2OeqB7STxzRWdbYW59MrmeffHiclKoO2Y4g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_report_lambda_function" {
        id                             = "demo_get_investment_year_report_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "9MqbpKJwWFP9S6RRgJHDjUVmF7NsklbapNhsavUfapQ=" -> "76bejh/2CHag6J++CjYRgVm8dMUmZ4M0K5mGWiQ6o/M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "hLCATZNRScqfIFsvdwK/ewCLR3XLQ3poTdkQZb1wyug=" -> "bizluGTuGNDALyoIQwybCYBl59Zj4rL2Sx6gOn10zGE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "4ILJoqpw96hSypheLs7DGqVvshEycmOudXUuw0PuX38=" -> "7F4MQP6l7EI1tuI/uRoyMJoIsjPeI4AmTb/GXlm+qFs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "I5snVgZfVo1K7uSoNRmaItrmwtxHIRAnL9pOQZ2ErLs=" -> "Yn4Udm8ZpYrE26tMSaX1NkqU6lvY397rzMRktpTbrj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "y1LuvA7GcQ8sVTEirPE2Iv8m85b1z2muJ1gg2UYlXls=" -> "fzmwsWqnTy624G9FVPUD1JWRFOdidPJPu4llOJ5flzs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "pfuEYxsj1bIRyeBKcVe3O+USi1f8JXL3ay8qEIjZOlQ=" -> "ZFDl3XHb1jzPXZ2LODe+Hq+rpqTaqfhjuBnJeJQrryE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "VC+k2MKEUVTN/xRZTkLlQ/GGjg8vc4I/qkBFUJKdpGc=" -> "J+Idz2d7Z4xN9CvASqCOieM4Ayh4nRtHmgThIaGwPEY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "qecZ96/bLZIpPMVdX7rd47DoW1ViHr6YelV23pGUmCA=" -> "+GQupPNl32MROKXnljUtLRZxhabrpYgfXUDiMrNyd0s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "12PWZi/g51jBTAEANz0UJtb/hD/AoCYnQAGB4GywuVc=" -> "EY4izfu/ODbc0aTFkvj466UWhfgYSLPp1/l3qkWF7y8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "INRvcwjCziT/9D/C1CXdgjeMBdoOEiA2sK6rbsjECvY=" -> "H6HS0lbiB2u+ydrFgLti3dAPGcoY96CfdLerms89zV4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-08-18T17:22:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "GOLfz/mSzdICQvVt6U1ItHtStyQsqLy3u4sYknnOcBw=" -> "cBd34HyUN6Y5wAHSkVQP/t+I22RHT4HG8V0YFzrWNPA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "RZXS442FJJLSNcOfItFbi9bj4IiaOQJR2vJLEFw9WR4=" -> "OsYZjhWYPRt30RQ/bMTLTDxFw36tBmoXX3UHw+QKdA0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-08-18T17:23:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "qMvWJrZ7Ild81uNiKXVw1/DO270643oPWeApriYhofE=" -> "6cU76CMaTumne2dZdyf4UsEMOlPamBfZg4QGBsIJ8ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-08-18T17:22:43Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "983138" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-08-18T17:22:42Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-08-18T17:22:41Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 77 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*